In [185]:
import pandas as pd

In [186]:
# To load the dataframe from the `fortune500.csv` file, you can use the following code:
df = pd.read_csv('fortune500.csv')
df.head(11)

    Year  Rank           Company  Income Revenue
0   1955     1    General Motors  9823.5     806
1   1955     2       Exxon Mobil  5661.4   584.8
2   1955     3        U.S. Steel  3250.4   195.4
3   1955     4  General Electric  2959.1   212.6
4   1955     5            Esmark  2510.8    19.1
5   1955     6          Chrysler  2071.6    18.5
6   1955     7            Armour  2056.1     1.6
7   1955     8          Gulf Oil  1705.3   182.8
8   1955     9             Mobil  1703.6   183.8
9   1955    10            DuPont  1687.7   344.4
10  1955    11             Amoco  1667.4   132.8

1. Tính Income trung bình của từng Company qua các Year

In [187]:
mean_income_yearly = df.groupby(['Company', 'Year'])['Income'].mean().reset_index(name='MeanIncome')
mean_income_yearly

                  Company  Year  MeanIncome
0                    3Com  1994       617.2
1                    3Com  1998      3147.1
2                    3Com  1999      5420.4
3                    3Com  2000      5772.1
4                    3Com  2001      5391.5
...                   ...   ...         ...
25446  Zenith Electronics  1991      1414.5
25447  Zenith Electronics  1992      1321.6
25448  Zenith Electronics  1993      1271.4
25449  Zenith Electronics  1994      1228.2
25450     Zurn Industries  1991       610.6

[25451 rows x 3 columns]

2. Tính Revenue trung bình của từng Company qua các Year

In [188]:
# Ensure the 'Revenue' column is numeric
df['Revenue'] = pd.to_numeric(df['Revenue'], errors='coerce') # convert N.A to NaN 

# Group by 'Company' and calculate the mean of 'Revenue'
mean_revenue_yearly = df.groupby(['Company', 'Year'])['Revenue'].mean().reset_index(name='MeanRevenue')
mean_revenue_yearly

                  Company  Year  MeanRevenue
0                    3Com  1994         38.6
1                    3Com  1998        374.0
2                    3Com  1999         30.2
3                    3Com  2000        403.9
4                    3Com  2001        674.3
...                   ...   ...          ...
25446  Zenith Electronics  1991        -63.3
25447  Zenith Electronics  1992        -51.6
25448  Zenith Electronics  1993       -105.9
25449  Zenith Electronics  1994        -97.0
25450     Zurn Industries  1991         28.3

[25451 rows x 3 columns]

Company by mean Revenue and mean Income

In [189]:
company_mean = pd.merge(mean_income_yearly, mean_revenue_yearly, on=['Company', 'Year'])
company_mean.head()

  Company  Year  MeanIncome  MeanRevenue
0    3Com  1994       617.2         38.6
1    3Com  1998      3147.1        374.0
2    3Com  1999      5420.4         30.2
3    3Com  2000      5772.1        403.9
4    3Com  2001      5391.5        674.3

3. Xác định Company có Income trung bình cao nhất

In [190]:
#? Method 1: retrieve max value by index -> retrieve 1 only 
highest_mean_income_index = company_mean['MeanIncome'].idxmax()
highest_mean_income_company = company_mean.loc[highest_mean_income_index, 'Company']

highest_mean_income_company

'Wal-Mart Stores'

In [191]:
#? Method 2: retrieve max value bu sorting -> can retrieve multiple company if their income is duplpicated 
highest_mean_income = company_mean['MeanIncome'].min()
highest_mean_income_company = company_mean[company_mean['MeanIncome'] == highest_mean_income]
highest_mean_income_company

                Company  Year  MeanIncome  MeanRevenue
6462   Copperweld Steel  1955        49.7          0.9
10619   Goodall-Sanford  1955        49.7         -2.7

In [192]:
#? Method 3: Retrieve by sorting and .head(1)
highest_mean_income_company = company_mean.sort_values(by='MeanIncome', ascending=False)
highest_mean_income_company.head(1)

               Company  Year  MeanIncome  MeanRevenue
24300  Wal-Mart Stores  2005    288189.0      10267.0

4. Xác định Company có Revenue trung bình thấp nhất

In [193]:
min_revenue = company_mean['MeanRevenue'].min()
lowest_mean_revenue_yearly = company_mean[company_mean['MeanRevenue'] == min_revenue]
lowest_mean_revenue_yearly

           Company  Year  MeanIncome  MeanRevenue
22867  Time Warner  2003     41780.0     -98696.0

5. Tìm Company có Income lớn nhất mỗi Year

In [194]:
highest_income = df['Income'].max()

highest_income_yearly = df.groupby('Year')['Income'].idxmax() # get index of highest Income Company through years
highest_income_yearly = highest_income_yearly.apply(lambda idx: df.loc[idx]) # find company by indexes

6. Tìm những Company thường nằm trong top 5 Company có Income lớn nhất qua mỗi Year

In [195]:
top5_frequent = []

7. Lọc ra 5 Company có Income trung bình thấp nhất

In [196]:
most_revenue_year = df.loc[df.groupby('Year')['Income'].idxmin()]
most_revenue_year.head()

      Year  Rank                   Company  Income  Revenue
498   1955   499           Goodall-Sanford    49.7     -2.7
999   1956   500             Warren (S.D.)    55.1      2.9
1499  1957   500  Consolidated Coppermines    61.1      5.7
1999  1958   500                    Akzona    64.7      1.3
2499  1959   500                 Blue Bell    61.7      1.7

8. Lọc ra 5 Company có Revenue trung bình cao nhất

9. Vẽ biểu đồ so sánh Income trung bình của 5 Company có Income trung bình thấp nhất